app/controllers/stories_controller.rb

  def create
    @story = Story.new(story_params)

    respond_to do |format|
      if @story.save
---
INSERT INTO "stories" ("content", "created_at", "desLat", "desLng", "destination", "name", "orLat", "orLng", "origin", "photo", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @story.update(story_params)
---
UPDATE "stories" SET "photo" = ?, "updated_at" = ? WHERE "stories"."id" = 2  [["photo", "http://www.france24.com/en/files/element_multimedia/diapo/5.jpg"], ["updated_at", Sun, 03 Nov 2013 00:56:59 UTC +00:00]]

  def destroy
    @story.destroy
---
DELETE FROM "stories" WHERE "stories"."id" = ?  [["id", 4]]